Revit 2024 API
FabricationItemFolder Class
 A fabrication item folder that can contain sub folders and access to the FabricationItemFiles contained within.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public class FabricationItemFolder : IDisposable
Visual Basic
Public Class FabricationItemFolder _
	Implements IDisposable
Visual C++
public ref class FabricationItemFolder : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FabricationItemFolder
See Also
FabricationItemFolder Members
Autodesk.Revit.DB Namespace